celubi/ArduinoCore-samd/variants/smt_test_00/variant.h
/*
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_FEATHER_M4_
#define _VARIANT_FEATHER_M4_

// The definitions here needs a SAMD core >=1.6.10
#define ARDUINO_SAMD_VARIANT_COMPLIANCE 10610

/*----------------------------------------------------------------------------
 *        Definitions
 *----------------------------------------------------------------------------*/

/** Frequency of the board main oscillator */
#define VARIANT_MAINOSC		(32768ul)

/** Master clock frequency */
#define VARIANT_MCK        (F_CPU)

#define VARIANT_GCLK0_FREQ (F_CPU)
#define VARIANT_GCLK1_FREQ (48000000UL)
#define VARIANT_GCLK2_FREQ (100000000UL)

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
#include "SERCOM.h"
#include "Uart.h"
#endif // __cplusplus

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

// Number of pins defined in PinDescription array
//#define PINS_COUNT           (44u)
#define PINS_COUNT           (45u) //--IP--SM-2023
#define NUM_DIGITAL_PINS     (23u)
#define NUM_ANALOG_INPUTS    (6u)
#define NUM_ANALOG_OUTPUTS   (1u)
#define analogInputToDigitalPin(p)  ((p < 6u) ? (p) + 14u : -1)

#define digitalPinToPort(P)        ( &(PORT->Group[g_APinDescription[P].ulPort]) )
#define digitalPinToBitMask(P)     ( 1 << g_APinDescription[P].ulPin )
//#define analogInPinToBit(P)        ( )
#define portOutputRegister(port)   ( &(port->OUT.reg) )
#define portInputRegister(port)    ( &(port->IN.reg) )
#define portModeRegister(port)     ( &(port->DIR.reg) )
#define digitalPinHasPWM(P)        ( g_APinDescription[P].ulPWMChannel != NOT_ON_PWM || g_APinDescription[P].ulTCChannel != NOT_ON_TIMER )

/*
 * digitalPinToTimer(..) is AVR-specific and is not defined for SAMD
 * architecture. If you need to check if a pin supports PWM you must
 * use digitalPinHasPWM(..).
 *
 * https://github.com/arduino/Arduino/issues/1833
 */
// #define digitalPinToTimer(P)

// LEDs
// #define PIN_LED_13           (13u)
// #define PIN_LED_RXL          (25u)
// #define PIN_LED_TXL          (26u)
// #define PIN_LED              PIN_LED_13
// #define PIN_LED2             PIN_LED_RXL
// #define PIN_LED3             PIN_LED_TXL
// #define LED_BUILTIN          PIN_LED_13
// #define PIN_NEOPIXEL         (8)
// #define PIN_NEOPIXEL_POWER   (7)


//NINA --IP--SM-2023
#define NINA_GPIO0  (30u)//PA27 pin51 -in Datalogger-GPIO0 | EXTINT11 | X18/Y18 | GCLK/IO1
#define NINA_RESETN (36u)//PA08-pin17 -in Datalogger-RSTN_NINA  | NMI   	| AIN8  | AIN2  | X6/Y6   | SERCOM0/PAD0    |SERCOM2/PAD1     |	TC0/WO0  |	TCC0/WO0  | TCC1/WO4  |
#define NINA_ACK    (44u)//PB30-pin59 -in Datalogger-PB30       | EXTINT14  | SERCOM7/PAD0         |SERCOM5/PAD1     |	TC0/WO0  |	TCC4/WO0  | TCC0/WO6


/*
 * Analog pins
 */
#define PIN_A0               (14ul)
#define PIN_A1               (PIN_A0 + 1)
#define PIN_A2               (PIN_A0 + 2)
#define PIN_A3               (PIN_A0 + 3)
#define PIN_A4               (PIN_A0 + 4)
#define PIN_A5               (PIN_A0 + 5)
#define PIN_A6               (PIN_A0 + 6)

#define PIN_DAC0             (14ul)
#define PIN_DAC1             PIN_A1

static const uint8_t A0  = PIN_A0;
static const uint8_t A1  = PIN_A1;
static const uint8_t A2  = PIN_A2;
static const uint8_t A3  = PIN_A3;
static const uint8_t A4  = PIN_A4;
static const uint8_t A5  = PIN_A5;
static const uint8_t A6  = PIN_A6 ;

static const uint8_t DAC0 = PIN_DAC0;
static const uint8_t DAC1 = PIN_DAC1;

#define ADC_RESOLUTION		12

// Other pins
#define PIN_ATN              (31ul)
static const uint8_t ATN = PIN_ATN;

/*
 * Serial interfaces
 */

// Serial1
#define PIN_SERIAL1_RX       (24ul)//PB23-pin50 -in Datalogger-RX | EXTINT7 	 | SERCOM2/PAD3         |SERCOM5/PAD3     |	TC7/WO1  | GCLK/IO1
#define PIN_SERIAL1_TX       (23ul)//PB22-pin49 -in Datalogger-TX | EXTINT6 	 | SERCOM2/PAD2         |SERCOM5/PAD2     |	TC7/WO0  | GCLK/IO0
#define PAD_SERIAL1_RX       (SERCOM_RX_PAD_3)
#define PAD_SERIAL1_TX       (UART_TX_PAD_2)

/*
 * SPI Interfaces
 */
#define SPI_INTERFACES_COUNT 2

#define PIN_SPI_MISO         (9u)//PA19-pin38 -in Datalogger-MISO| EXTINT3| X13/Y13 | SERCOM1/PAD3|SERCOM3/PAD3|	TC3/WO1  |	TCC1/WO3  | TCC0/WO7|
#define PIN_SPI_MOSI         (5u)//PA16-pin35 -in Datalogger-MOSI| EXTINT0| X10/Y10 | SERCOM1/PAD0|SERCOM3/PAD1|	TC2/WO0  |	TCC1/WO0  | TCC0/WO4  | ----  | ---- | GCLK/IO2
#define PIN_SPI_SCK          (25u)//PA17-pin36 -in Datalogger-SCK| EXTINT1| X11/Y11 | SERCOM1/PAD1|SERCOM3/PAD0|	TC2/WO1  |	TCC1/WO1  | TCC0/WO5  | ----  | ---- | GCLK/IO3
#define PERIPH_SPI           sercom1
#define PAD_SPI_TX           SPI_PAD_0_SCK_1
#define PAD_SPI_RX           SERCOM_RX_PAD_3

static const uint8_t SS	  = 9 ;	// SERCOM1 last PAD is present on d9 but HW SS isn't used. Set here only for reference.
static const uint8_t MOSI = PIN_SPI_MOSI ;
static const uint8_t MISO = PIN_SPI_MISO ;
static const uint8_t SCK  = PIN_SPI_SCK ;


// // SPI1
#define PIN_SPI1_MISO    (3u)//PA15-pin32 -in Datalogger-RX/MISO-NINA| EXTINT13 | SERCOM2/PAD3 |SERCOM4/PAD0     |	TC2/WO1  |	TCC0/WO7  | TCC1/WO3  | ----  | ---- | -------
#define PIN_SPI1_MOSI    (21u)//PA12-pin29 -in Datalogger-TX/MOSI-NINA| EXTINT12 | SERCOM2/PAD0 |SERCOM4/PAD1     |	TC2/WO0  |	TCC0/WO6  | TCC1/WO2  | ----  | ---- | -------
#define PIN_SPI1_SCK     (22u)//PA13-pin30 -in Datalogger-CTS/SCK-NINA| EXTINT15 | SERCOM2/PAD1 |SERCOM4/PAD3     |	TC3/WO1  |	TCC2/WO1  | TCC1/WO3  | ----  | ---- | GCLK/IO1
#define PIN_SPI1_SS      (4u)//PA14-pin31 -in Datalogger-RTS/CS-NINA | EXTINT14 | SERCOM2/PAD2 |SERCOM4/PAD2     |	TC3/WO0  |	TCC2/WO0  | TCC1/WO2  | ----  | ---- | GCLK/IO0
#define PERIPH_SPI1   sercom2
#define PAD_SPI1_TX   SPI_PAD_0_SCK_1
#define PAD_SPI1_RX   SERCOM_RX_PAD_3
static const uint8_t SS1   = PIN_SPI1_SS;
static const uint8_t MOSI1 = PIN_SPI1_MOSI;
static const uint8_t MISO1 = PIN_SPI1_MISO;
static const uint8_t SCK1  = PIN_SPI1_SCK;

#define SPIWIFI_SS       PIN_SPI1_SS
#define SPIWIFI_ACK      NINA_ACK
#define SPIWIFI_RESET    NINA_RESETN
/*
 * Wire Interfaces
 */
#define WIRE_INTERFACES_COUNT 1

#define PIN_WIRE_SDA         (16u)//PB08-pin11 -in Datalogger-A4/SDA| EXTINT8	| AIN2  | AIN0 | X1/Y1 |--|SERCOM4/PAD0|	TC4/WO0  |	----	  | --------  | ----  | ---- | -------
#define PIN_WIRE_SCL         (17u)//PB09-pin12 -in Datalogger-A5/SCL| EXTINT9	| AIN3  | AIN1 | X2/Y2 |--|SERCOM4/PAD1|	TC4/WO1  |	----	  | --------  | ----  | ---- | -------
#define PERIPH_WIRE          sercom4
#define WIRE_IT_HANDLER      SERCOM4_Handler
#define WIRE_IT_HANDLER_0    SERCOM4_0_Handler
#define WIRE_IT_HANDLER_1    SERCOM4_1_Handler
#define WIRE_IT_HANDLER_2    SERCOM4_2_Handler
#define WIRE_IT_HANDLER_3    SERCOM4_3_Handler

static const uint8_t SDA = PIN_WIRE_SDA;
static const uint8_t SCL = PIN_WIRE_SCL;

/*
 * USB
 */
#define PIN_USB_HOST_ENABLE (27ul)
#define PIN_USB_DM          (29ul)//PA24-pin45 -in Datalogger-USB_DM     | EXTINT8 	|  -----  | ----- | ----    | ----  | ---  | ------- | SERCOM3/PAD2         |SERCOM5/PAD2     |	TC5/WO0  |	TCC2/WO2  | --------  | ----  | ---- | --------
#define PIN_USB_DP          (28ul)//PA25-pin46 -in Datalogger-USB_DP     | EXTINT9 	|  -----  | ----- | ----    | ----  | ---  | ------- | SERCOM3/PAD3         |SERCOM5/PAD3     |	TC5/WO1  |	--------  | --------  | ----  | ---- | --------

/*
 * I2S Interfaces
 */
#define I2S_INTERFACES_COUNT 1

#define I2S_DEVICE          0
#define I2S_CLOCK_GENERATOR 3

#define PIN_I2S_SDO          (11u)
#define PIN_I2S_SDI          (12u)
#define PIN_I2S_SCK          PIN_SERIAL1_TX
#define PIN_I2S_FS           (10u)
#define PIN_I2S_MCK          PIN_SERIAL1_RX

// On-board QSPI Flash
#define EXTERNAL_FLASH_DEVICES   GD25Q16C
#define EXTERNAL_FLASH_USE_QSPI

//QSPI Pins
// #define PIN_QSPI_SCK    (34u)
// #define PIN_QSPI_CS     (35u)
// //#define PIN_QSPI_IO0    (36u)
// #define PIN_QSPI_IO1    (37u)
// #define PIN_QSPI_IO2    (38u)
// #define PIN_QSPI_IO3    (39u)

#if !defined(VARIANT_QSPI_BAUD_DEFAULT)
  // TODO: meaningful value for this
  #define VARIANT_QSPI_BAUD_DEFAULT 5000000
#endif

/*
 * CAN
 */
// #define PIN_CAN_STANDBY (40)
// #define PIN_CAN_BOOSTEN (41)
// #define PIN_CAN_TX      (42)
// #define PIN_CAN_RX      (43)

// #define PIN_CAN1_TX     (12)
// #define PIN_CAN1_RX     (13)


#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus

/*	=========================
 *	===== SERCOM DEFINITION
 *	=========================
*/
extern SERCOM sercom0;
extern SERCOM sercom1;
extern SERCOM sercom2;
extern SERCOM sercom3;
extern SERCOM sercom4;
extern SERCOM sercom5;

extern Uart Serial1;

extern Uart Serial2;
#define PIN_SERIAL2_RX       (13ul)//PA23-pin44 -in Datalogger-RX_NINA    | EXTINT7  | X17/Y17 | SERCOM3/PAD1         |SERCOM5/PAD0     |	TC4/WO1  |	TCC1/WO7  | TCC0/WO3  | ----  | ---- | --------
#define PIN_SERIAL2_TX       (12ul)//PA22-pin43 -in Datalogger-TX_NINA    | EXTINT6  | X16/Y16 | SERCOM3/PAD0         |SERCOM5/PAD1     |	TC4/WO0  |	TCC1/WO6  | TCC0/WO2  | ----  | ---- | --------
#define PAD_SERIAL2_TX       (UART_TX_PAD_0)
#define PAD_SERIAL2_RX       (SERCOM_RX_PAD_1)
#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_USBVIRTUAL      Serial
#define SERIAL_PORT_MONITOR         Serial
// Serial has no physical pins broken out, so it's not listed as HARDWARE port
#define SERIAL_PORT_HARDWARE        Serial1
#define SERIAL_PORT_HARDWARE_OPEN   Serial1

#define SerialNina                  Serial2
#define SPIWIFI                     SPI1

#endif /* _VARIANT_FEATHER_M4_ */

